keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxHsct_bf.h
/** \\brief  Offset for Ifx_HSCT_IRQCLR_Bits.PYERCLR */
#define IFX_HSCT_IRQCLR_PYERCLR_OFF (2)

/** \\brief  Length for Ifx_HSCT_IRQCLR_Bits.SFOEN */
#define IFX_HSCT_IRQCLR_SFOEN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQCLR_Bits.SFOEN */
#define IFX_HSCT_IRQCLR_SFOEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQCLR_Bits.SFOEN */
#define IFX_HSCT_IRQCLR_SFOEN_OFF (11)

/** \\brief  Length for Ifx_HSCT_IRQCLR_Bits.SFUEN */
#define IFX_HSCT_IRQCLR_SFUEN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQCLR_Bits.SFUEN */
#define IFX_HSCT_IRQCLR_SFUEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQCLR_Bits.SFUEN */
#define IFX_HSCT_IRQCLR_SFUEN_OFF (12)

/** \\brief  Length for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_OFF (5)

/** \\brief  Length for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_OFF (10)

/** \\brief  Length for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_OFF (8)

/** \\brief  Length for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_OFF (6)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.CEREN */
#define IFX_HSCT_IRQEN_CEREN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.CEREN */
#define IFX_HSCT_IRQEN_CEREN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.CEREN */
#define IFX_HSCT_IRQEN_CEREN_OFF (3)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.HEREN */
#define IFX_HSCT_IRQEN_HEREN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.HEREN */
#define IFX_HSCT_IRQEN_HEREN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.HEREN */
#define IFX_HSCT_IRQEN_HEREN_OFF (1)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.IFCFSEN */
#define IFX_HSCT_IRQEN_IFCFSEN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.IFCFSEN */
#define IFX_HSCT_IRQEN_IFCFSEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.IFCFSEN */
#define IFX_HSCT_IRQEN_IFCFSEN_OFF (4)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.PAREN */
#define IFX_HSCT_IRQEN_PAREN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.PAREN */
#define IFX_HSCT_IRQEN_PAREN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.PAREN */
#define IFX_HSCT_IRQEN_PAREN_OFF (9)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.PLEREN */
#define IFX_HSCT_IRQEN_PLEREN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.PLEREN */
#define IFX_HSCT_IRQEN_PLEREN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.PLEREN */
#define IFX_HSCT_IRQEN_PLEREN_OFF (7)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.PYEREN */
#define IFX_HSCT_IRQEN_PYEREN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.PYEREN */
#define IFX_HSCT_IRQEN_PYEREN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.PYEREN */
#define IFX_HSCT_IRQEN_PYEREN_OFF (2)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_OFF (11)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_OFF (12)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.SMEREN */
#define IFX_HSCT_IRQEN_SMEREN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.SMEREN */
#define IFX_HSCT_IRQEN_SMEREN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.SMEREN */
#define IFX_HSCT_IRQEN_SMEREN_OFF (5)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.TXTEEN */
#define IFX_HSCT_IRQEN_TXTEEN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.TXTEEN */
#define IFX_HSCT_IRQEN_TXTEEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.TXTEEN */
#define IFX_HSCT_IRQEN_TXTEEN_OFF (10)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.USMEN */
#define IFX_HSCT_IRQEN_USMEN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.USMEN */
#define IFX_HSCT_IRQEN_USMEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.USMEN */
#define IFX_HSCT_IRQEN_USMEN_OFF (8)

/** \\brief  Length for Ifx_HSCT_IRQEN_Bits.USMSFEN */
#define IFX_HSCT_IRQEN_USMSFEN_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IRQEN_Bits.USMSFEN */
#define IFX_HSCT_IRQEN_USMSFEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IRQEN_Bits.USMSFEN */
#define IFX_HSCT_IRQEN_USMSFEN_OFF (6)

/** \\brief  Length for Ifx_HSCT_KRST0_Bits.RST */
#define IFX_HSCT_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_HSCT_KRST0_Bits.RST */
#define IFX_HSCT_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_KRST0_Bits.RST */
#define IFX_HSCT_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_HSCT_KRST0_Bits.RSTSTAT */
#define IFX_HSCT_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_HSCT_KRST0_Bits.RSTSTAT */
#define IFX_HSCT_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_KRST0_Bits.RSTSTAT */
#define IFX_HSCT_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_HSCT_KRST1_Bits.RST */
#define IFX_HSCT_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_HSCT_KRST1_Bits.RST */
#define IFX_HSCT_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_KRST1_Bits.RST */
#define IFX_HSCT_KRST1_RST_OFF (0)

